Tweetchive/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("created_at", "status", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 09 Aug 2012 08:02:14 UTC +00:00], ["status", "http://twitter.com/elcomercio/status/233465148654882817"], ["updated_at", Thu, 09 Aug 2012 08:02:14 UTC +00:00]]
---
  def create
    @tweet = Tweet.new(params[:tweet])

    respond_to do |format|
      if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "tweets" SET "status" = '233461820420136960', "updated_at" = '2012-08-09 08:47:08.643419' WHERE "tweets"."id" = 3
---
  def update
    @tweet = Tweet.find(params[:id])

    respond_to do |format|
      if @tweet.update_attributes(params[:tweet])

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 2]]
---
  def destroy
    @tweet = Tweet.find(params[:id])
    @tweet.destroy